# Indexing DataFrames

### A Simple DataFrame

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('sales/sales.csv', index_col='month')

In [3]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### Indexing using square brackets

In [4]:
#df['column name']['row label']
df ['salt']['Jan']

12.0

### Using column attribute and row label

In [5]:
#df.column_attribute['row label']
df.eggs['Mar']

221

### Using the .loc accessor

In [6]:
df.loc['May', 'spam']

52

### Using the .iloc accesor

In [7]:
df.iloc[4,2]

52

### Selecting only some columns

In [8]:
df_new = df[['salt', 'eggs']]
df_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

### Postional and labeled indexing 
Given a pair of label-based indices, sometimes it's necessary to find the corresponding positions.
Find `x` and `y` such that `election.iloc[x,y] == elections.loc['Bedford', 'winner']`

In [9]:
election = pd.read_csv('pennsylvania2012_turnout.csv', index_col='county')
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [10]:
#election.columns
winner_index = list(election.columns).index('winner')
winner_index

4

In [11]:
bedford_index = list(election.index).index('Bedford')
bedford_index

4

In [12]:
election.iloc[bedford_index, winner_index]

'Romney'

### Indexing and column rearrangement
There are circumstances in which it's useful to modify the order of your DataFrame columns. 
We do that now by extracting just two columns from the Pennsylvania election.

In [13]:
election = pd.read_csv('pennsylvania2012_turnout.csv', index_col='county')
results = election[['winner', 'total', 'voters']]
results.head()

           winner   total  voters
county
Adams      Romney   41973   61156
Allegheny   Obama  614671  924351
Armstrong  Romney   28322   42147
Beaver     Romney   80015  115157
Bedford    Romney   21444   32189

### Slicing DataFrames

In [15]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### Selecting a column

In [16]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [17]:
type(df['eggs'])

pandas.core.series.Series

### Slicing and indexing a Series

In [18]:
df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [19]:
df['eggs'][4]

132

### Using .loc[] (1)

In [20]:
df.loc[:, 'eggs':'salt'] # All rows, some columns

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

### Using  .loc[] (2)

In [23]:
df.loc['Jan':'Apr', :] #Some rows, all columns

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

### Using .loc[] (3)

In [24]:
df.loc['Mar':'May', 'salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

### Using .iloc[]

In [25]:
df.iloc[2:5, 1:] # block from the middle of the dataframe

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

### Using lists rather than slices (1)

In [26]:
df.loc['Jan':'May', ['eggs','spam']]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52

### Using lists rather than slices (2)

In [27]:
df.iloc[[0,4,5], 0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

### Series verus 1-column DataFrame

In [28]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [29]:
type(df['eggs'])

pandas.core.series.Series

In [30]:
df[['eggs']]

       eggs
month
Jan      47
Feb     110
Mar     221
Apr      77
May     132
Jun     205

In [31]:
type(df[['eggs']])

pandas.core.frame.DataFrame

In [34]:
#Slice the row labels 'Perry' to 'Potter': p_counties
p_counties = election.loc['Perry':'Potter', :]
p_counties

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681

In [36]:
p_counties_rev = election.loc['Potter':'Perry':-1]
p_counties_rev

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272

In [37]:
#Slice the columns from the starting column to 'Obama'
left_columns = election.loc[:, :'Obama']
left_columns.head()

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452

In [40]:
middle_columns = election.loc[:, 'Obama':'winner']
middle_columns.head()

               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney

In [43]:
right_columns = election.loc[:, 'Romney':]
right_columns.head()

              Romney  winner  voters    turnout     margin
county
Adams      63.112001  Romney   61156  68.632677  27.629667
Allegheny  42.185820   Obama  924351  66.497575  14.454399
Armstrong  67.901278  Romney   42147  67.198140  37.204293
Beaver     52.637630  Romney  115157  69.483401   6.605012
Bedford    76.986570  Romney   32189  66.619031  54.929118